#include <iostream>
#include<cmath> //подключение библиотеки, для возведения в степень и извлечения квадратного корня

using namespace std;

int main() {
    setlocale(LC_ALL, ".65001");
    double sum{0}; // объявление и инициализация переменной для хранения суммы                         
    const double e = 2.71828182845904523536; //объявление и инициализация константы e, для вычисления элементов ряда
    for(int i = 1; i <= 7; ++i)//цикл, по условию надо найти сумму 7 членов ряда, поэтому начинаем с 1 и по 7 включительно
    { 
        double an = (i*i)*pow(e, -sqrt(i)); //объявление и инициализация an члена ряда, по формуле
        sum += an;//присваивение переменной sum значение an члена ряда
    }
    cout << "Сумма 7 членов ряда равна " << sum; //вывод на экран резудьтата суммы 7 членов ряда
    return 0;
}