#include <iostream> //директива отвечающая за входные, выходные потоки данных
#include<cmath> //библиотке для использование математических функций

using namespace std; //подключение стандартного прсторанства имём

int main() {
    int n = 20, k = 10; //объявление и инициализация переменных, n - количество членов ряда, k нужно для вычисление шага цикла
    double a = 0.1;//объявление и инициализация переменных, a - левая граница, от которой будет изменяться x
    double b = 1;//объявление и инициализация переменных, b - правая граница, до которой будет изменяться x
    double st = (b-a)/k;//объявление и инициализация переменных, st - величина, на которую будет изменяться x в цикле
    double e =0.0001;//объявление и инициализация переменных, e - заданная точность
    for(double x = a; x <= b; x += st){ //первый цикл, для изменения x
        double y =  (exp(x) - exp(-x))/2; //вычисление функции y согласно формуле из лаюораторной работы
        double sn = 0; //объявление и инициализация переменных, sn - сумма n членов ряда
        double an = x; //объявление и инициализация переменных, an - первый член ряда

        for(int i = 0; i <= n; ++i){ //цикл для нахождение суммы n членов ряда
            sn += an; //увеличиваем sn на an
            an *= (x*x)/((2*i+ 2)*(2 * i +3)); // нахождение n+i-ого члена ряда по рекурентной формуле
        }
        
        double se = 0; //объявление и инициализация переменных, se - сумма членов ряда для заданной точности
        int i = 0; // объявление и инициализация переменных, i - iтый член ряда
        an = x; // объявление и инициализация переменных, сбрасываем для вычисление суммы для заданной точности

        while(abs(an) > e){ //цикл для нахждения суммы для заданной точности
            se += an; //увеличиваем se на an
            an *= (x*x)/((2*i+ 2)*(2 * i +3)); // нахождение n+i-ого члена ряда по рекурентной формуле
        }
        cout << "X = " << x << " SN = " << sn <<" SE = " << se << " Y = " << y << endl; //вывод данных
}
}