#include<iostream>                                                                           //директива iostream обеспечивает входные и выходные потоки данных
#include<math.h>                                                                             //подключение библиотечного файла math.h для использования функции pow, позволяющей возводить значение в определённую степень

using namespace std;                                                                         //используем стандартное пространство имён, чтобы избежать конфликтов

int main(){
    setlocale(LC_ALL, ".65001");                                                             //функция setlocale для подключения русского языка
    float fa{1000}, fb{0.0001};                                                              //объявление и инициализация пременных: fa и fb типа float
    float fres;                                                                             //объявление переменной fres типа float
    fres = (pow((fa-fb), 3)-(pow(fa, 3) - 3 *pow(fa, 2)*fb))/(pow(fb,3)-3*fa*pow(fb,2));    //присваивание переменной fres результата примера
    cout << fres << '\n';                                                                   // вывод в консоль переменной fres = 2.20703e+06 и перевод курсора на новую строку 

    double da{1000}, db(0.0001);                                                            //объявление и инициализация пременных: da и db типа double
    double dres;                                                                            //объявление переменной dres типа double
    dres = (pow((da-db), 3)-(pow(da, 3) - 3 *pow(da, 2)*db))/(pow(db,3)-3*da*pow(db,2));    //присваивание переменной dres результата примера
    cout << dres;                                                                           // вывод в консоль переменной dres = -1.00136
}
