#include<iostream>                  //директива iostream обеспечивает входные и выходные потоки данных

using namespace std;                                                                         //используем стандартное пространство имён, чтобы избежать конфликтов

int main(){
    setlocale(LC_ALL, ".65001");                                                             //функция setlocale для подключения русского языка
    int m, n;                                                                               //объявление пременных m и n целого типа
    cin >> m >> n;                                                                          //ввод значений m и n с клавиатуры
    cout << - -m - ++n << '\n';                                                               //- - это двойной унарный минус из-за этого следует, что к m применяется двойное отрицание, препрефексный инкремент увеличивает n на 1, из m вычитается n
    cout << (m*n < n++) << '\n';                                                            //т.к. сдесь используется операция сравнения, то тип выраения bool, может принимать значение либо 0, либо 1, постфиксный инкремент увеличивает значение n на 1 после выполнения условия
    cout << (n-- > m++);                                                                    //т.к. сдесь используется операция сравнения, то тип выраения bool, может принимать значение либо 0, либо 1, постфиксный декремент уменьшает n на 1 после выполнения операции сравнения, постфиксный инкремент увеличивает m на 1 после выполнения оперции сравнения
    return 0;
}